"""
Задание 2.

Реализуйте два алгоритма.

Первый, в виде функции, должен обеспечивать поиск минимального значения для списка.
В основе алгоритма должно быть сравнение каждого числа со всеми другими элементами списка.
Сложность такого алгоритма: O(n^2) - квадратичная.

Второй, в виде функции, должен обеспечивать поиск минимального значения для списка.
Сложность такого алгоритма: O(n) - линейная.

Примечание:
Построить список можно через генератор списка.
Если у вас возникают сложности, постарайтесь подумать как можно решить задачу,
а не писать "мы это не проходили)".
Алгоритмизатор должен развивать мышление, а это прежде всего практика.
А без столкновения со сложностями его не развить.
"""

from random import randint


# O(n^2):
def min_n2_list(arg_list):
    min_el = arg_list[0]
    for i in arg_list:
        for j in arg_list:
            if j < i and j < min_el:
                min_el = j
    return min_el


# O(n):
def min_n_list(arg_list):
    min_el = arg_list[0]
    for el in arg_list:
        if el < min_el:
            min_el = el
    return min_el


lst = [randint(0, 100) for i in range(30)]
print(lst)
print(min_n2_list(lst))
print(min_n_list(lst))
